import { createSlice } from '@reduxjs/toolkit';

const initialState = {
  products: [
    {
      id: 1,
      item_name: 'Men Casual Shirt',
      category: 'shirt',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/5.avif',
      rating: {
        stars: 4.5,
        count: 210,
      },
      original_price: 2000,
      discount_percentage: 50,
      isTrending: true,
      type: 'casual',
      sizes: ['sm', 'md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue', 'black'], //  colors array
    },
    {
      id: 2,
      item_name: 'Slim Fit Shirt',
      category: 'shirt',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/men2.jpg',
      rating: {
        stars: 4.2,
        count: 150,
      },
      original_price: 1500,
      discount_percentage: 34,
      isTrending: true,
      type: 'formal',
      sizes: ['md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue'], //  colors array
    },
    {
      id: 3,
      item_name: 'Slim Fit Shirt',
      category: 'shirt',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/men7.jpg',
      rating: {
        stars: 4.2,
        count: 150,
      },
      original_price: 1000,
      discount_percentage: 34,
      sizes: ['sm', 'md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue', 'black'], //  colors array
    },
    {
      id: 4,
      item_name: 'Slim Fit Shirt',
      category: 'shirt',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/men1.webp',
      rating: {
        stars: 4.2,
        count: 150,
      },
      original_price: 1000,
      discount_percentage: 34,
      sizes: ['md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue'], //  colors array
    },
    {
      id: 5,
      item_name: 'Slim Fit Shirt',
      category: 'shirt',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/men3.webp',
      rating: {
        stars: 4.2,
        count: 150,
      },
      original_price: 1500,
      discount_percentage: 34,
      isTrending: true,
      sizes: ['sm', 'md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue', 'black'], //  colors array
    },
    {
      id: 6,
      item_name: 'Slim Fit Shirt',
      category: 'shirt',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/men6.jpg',
      rating: {
        stars: 4.2,
        count: 150,
      },
      original_price: 1500,
      discount_percentage: 34,
      isTrending: true,
      type: 'custom',
      sizes: ['sm', 'md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue', 'black'], //  colors array
    },
    {
      id: 7,
      item_name: 'Slim Fit T-Shirt',
      category: 'tshirt',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/1.avif',
      rating: {
        stars: 4.2,
        count: 150,
      },
      original_price: 1500,
      discount_percentage: 34,
      sizes: ['md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue'], //  colors array
    },
    {
      id: 8,
      item_name: 'Slim Fit T-Shirt',

      category: 'tshirt',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/men.webp',
      rating: {
        stars: 4.2,
        count: 150,
      },
      original_price: 1500,
      discount_percentage: 34,
      sizes: ['md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue'], //  colors array
    },
    {
      id: 9,
      item_name: 'Slim Fit T-Shirt',
      category: 'tshirt',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/men8.jpg',
      rating: {
        stars: 4.2,
        count: 150,
      },
      original_price: 1500,
      discount_percentage: 34,
      isTrending: true,
      type: 'oversized',
      sizes: ['sm', 'md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue', 'black'], //  colors array
    },
    {
      id: 10,
      item_name: 'Slim Fit T-Shirt',
      category: 'tshirt',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/p5.png',
      rating: {
        stars: 4.2,
        count: 150,
      },
      original_price: 1500,
      discount_percentage: 34,
      type: 'plain',
      sizes: ['md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue'], //  colors array
    },
    {
      id: 11,
      item_name: 'Slim Fit T-Shirt',
      category: 'tshirt',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/t-shirt.jpg',
      rating: {
        stars: 4.2,
        count: 150,
      },
      original_price: 1500,
      discount_percentage: 34,
      sizes: ['sm', 'md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue', 'black'], //  colors array
    },
    {
      id: 12,
      item_name: 'Slim Fit T-Shirt',
      category: 'tshirt',
      info: {
        title: 'TShirt Information',
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/t-shirt2.jpg',
      rating: {
        stars: 4.2,
        count: 150,
      },
      original_price: 1500,
      discount_percentage: 34,
      isTrending: true,
      type: 'custom',
      sizes: ['sm', 'md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue', 'black'], //  colors array
    },

    {
      id: 13,
      item_name: 'Oversized hoodie',
      category: 'hoodie',
      info: {
        messages: [
          '📌 SIZE CHART (সলিড কালার হুডি)',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/3.jfif',
      rating: {
        stars: 4.6,
        count: 320,
      },
      original_price: 2600,
      discount_percentage: 31,
      type: 'oversized',
      sizes: ['md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue'], //  colors array
    },
    {
      id: 14,
      item_name: 'Permium hoodie',
      category: 'hoodie',
      info: {
        title: 'Hoodie Information',
        messages: [
          '📌 SIZE CHART (সলিড কালার হুডি)',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/hoodie1.jpg',
      rating: {
        stars: 4.6,
        count: 320,
      },
      original_price: 2600,
      discount_percentage: 31,
      sizes: ['sm', 'md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue', 'black'], //  colors array
    },
    {
      id: 15,
      item_name: 'Lightweight hoodie',
      category: 'hoodie',
      info: {
        title: 'Hoodie Information',
        messages: [
          '📌 SIZE CHART (সলিড কালার হুডি)',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/hoodie2.avif',
      rating: {
        stars: 4.6,
        count: 320,
      },
      original_price: 2600,
      discount_percentage: 31,
      type: 'lightweight',
      sizes: ['md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue'], //  colors array
    },
    {
      id: 16,
      item_name: 'Permium hoodie',
      category: 'hoodie',
      info: {
        title: 'Hoodie Information',
        messages: [
          '📌 SIZE CHART (সলিড কালার হুডি)',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/hoodie3.webp',
      rating: {
        stars: 4.6,
        count: 320,
      },
      original_price: 2600,
      discount_percentage: 31,
      isTrending: true,
      sizes: ['sm', 'md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue', 'black'], //  colors array
    },
    {
      id: 17,
      item_name: 'Permium hoodie',
      category: 'hoodie',
      info: {
        title: 'Hoodie Information',
        messages: [
          '📌 SIZE CHART (সলিড কালার হুডি)',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/hoodie4.jpg',
      rating: {
        stars: 4.6,
        count: 320,
      },
      original_price: 2600,
      discount_percentage: 31,
      sizes: ['md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue'], //  colors array
    },
    {
      id: 18,
      item_name: 'Custom hoodie',
      category: 'hoodie',
      info: {
        title: 'Hoodie Information',
        messages: [
          '📌 SIZE CHART (সলিড কালার হুডি)',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      info: {
        title: 'Hoodie Information',
        messages: [
          '📌 SIZE CHART (সলিড কালার হুডি)',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/hoodie5.avif',
      rating: {
        stars: 4.6,
        count: 320,
      },
      original_price: 2600,
      discount_percentage: 31,
      isTrending: true,
      type: 'custom',
      sizes: ['sm', 'md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue', 'black'], //  colors array
    },
    {
      id: 19,
      item_name: 'Casual Punjabi',
      category: 'punjabi',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/punjabi1.jpg',
      rating: {
        stars: 4.6,
        count: 320,
      },
      original_price: 2600,
      discount_percentage: 31,
      isTrending: true,
      type: 'casual',
      sizes: ['md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue'], //  colors array
    },
    {
      id: 20,
      item_name: 'Premium Punjabi',
      category: 'punjabi',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/punjabi2.webp',
      rating: {
        stars: 4.6,
        count: 320,
      },
      original_price: 2600,
      discount_percentage: 31,
      isTrending: true,
      type: 'premium',
      sizes: ['sm', 'md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue', 'black'], //  colors array
    },
    {
      id: 21,
      item_name: 'Wedding Punjabi',
      category: 'punjabi',
      info: {
        messages: [
          '📌 SIZE CHART ',
          'M = Chest 40, Length 26, Sleeve 24',
          'L = Chest 42, Length 27, Sleeve 25',
          'XL = Chest 44, Length 28, Sleeve 26',
          'XXL = Chest 46, Length 29, Sleeve 27',

          '🧥 প্রিমিয়াম কটন ফ্লিস সলিড কালার হুডি',
          '✅ ১০০% এক্সপোর্ট কোয়ালিটি ফেব্রিক',
          '✅ কালার ওয়াশ গ্যারান্টি',
          '✅ সফট ও কমফোর্ট ফিট',
          '✅ ফুল স্লিভ',
          '✅ হুডি ক্যাপ (ড্র-স্ট্রিং সহ)',
          '✅ সামনের ক্যাঙ্গারু পকেট',
          '✅ পারফেক্ট সাইজ মেজারমেন্ট',

          '💰 সারা বাংলাদেশে ক্যাশ অন হোম ডেলিভারি',
          '📦 চেক করে দেখে নেওয়ার সুবিধা',
          '🔄 পছন্দ না হলে ডেলিভারি চার্জ দিয়ে রিটার্ন / এক্সচেঞ্জ',
          '🚚 ঢাকার ভিতরে ডেলিভারি চার্জ – ৭০৳',
          '🚛 ঢাকার বাইরে ডেলিভারি চার্জ – ১৩০৳',
        ],
      },
      image: '/images/punjabi3.jpg',
      rating: {
        stars: 4.6,
        count: 320,
      },
      original_price: 2600,
      discount_percentage: 31,
      isTrending: true,
      type: 'wedding',
      sizes: ['sm', 'md', 'lg', 'xl'], //  sizes array
      colors: ['white', 'blue', 'black'], //  colors array
    },
  ],
};

const productsSlice = createSlice({
  name: 'products',
  initialState,
  reducers: {},
});

export default productsSlice.reducer;
